print('Hi, PyCharm')

# Установка точки останова (breakpoint):
# Найдите первую строку с print('Hi, PyCharm').
# Нажмите на номер строки слева от кода, чтобы установить точку останова. Это будет обозначено красной точкой.

x = 43
y = 32
print(x * y)
print("End line")

# Запуск в режиме отладки:
# Нажмите на иконку дебага (жучка) в правом верхнем углу PyCharm или используйте комбинацию клавиш Shift + F9.

# Наблюдение за результатом:
# Когда программа остановится на точке остановки, вы увидите переменные в области отладки.
# В консоли увидите результат выполнения до точки останова.

# Использование Step Over:
# После остановки на точке останова нажмите на кнопку "Step Over" (обычно это клавиша F8).
# Программа выполнит следующую строку, и вы сможете наблюдать, как значения переменных меняются в области отладки.

# Просмотр результата:
# Посмотрите на консоль, чтобы увидеть, как выполняются команды, и какие значения выводятся.
